{"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"batch_input_shape": [null, 1, 60, 20], "input_dtype": "float32", "trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Graph", "config": {"node_config": [{"merge_mode": "concat", "input": "input", "dot_axes": -1, "name": "conv-2", "create_output": false, "inputs": [], "concat_axis": -1}, {"merge_mode": "concat", "input": "conv-2", "dot_axes": -1, "name": "maxpool-2", "create_output": false, "inputs": [], "concat_axis": -1}, {"merge_mode": "concat", "input": "maxpool-2", "dot_axes": -1, "name": "flatten-2", "create_output": false, "inputs": [], "concat_axis": -1}, {"merge_mode": "concat", "input": "input", "dot_axes": -1, "name": "conv-3", "create_output": false, "inputs": [], "concat_axis": -1}, {"merge_mode": "concat", "input": "conv-3", "dot_axes": -1, "name": "maxpool-3", "create_output": false, "inputs": [], "concat_axis": -1}, {"merge_mode": "concat", "input": "maxpool-3", "dot_axes": -1, "name": "flatten-3", "create_output": false, "inputs": [], "concat_axis": -1}, {"merge_mode": "concat", "input": "input", "dot_axes": -1, "name": "conv-4", "create_output": false, "inputs": [], "concat_axis": -1}, {"merge_mode": "concat", "input": "conv-4", "dot_axes": -1, "name": "maxpool-4", "create_output": false, "inputs": [], "concat_axis": -1}, {"merge_mode": "concat", "input": "maxpool-4", "dot_axes": -1, "name": "flatten-4", "create_output": false, "inputs": [], "concat_axis": -1}], "output_config": [{"merge_mode": "concat", "input": null, "name": "output", "inputs": ["flatten-2", "flatten-3", "flatten-4"], "concat_axis": -1, "dot_axes": -1}], "input_config": [{"dtype": "float32", "input_shape": [1, 60, 20], "name": "input"}], "nodes": {"conv-3": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "nb_filter": 150, "bias": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "conv-3", "batch_input_shape": [null, 1, 60, 20], "trainable": true, "nb_col": 20, "subsample": [1, 1], "border_mode": "valid"}}, "maxpool-3": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpool-3", "pool_size": [58, 1], "trainable": true, "strides": [58, 1], "border_mode": "valid"}}, "flatten-3": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-3"}}, "maxpool-2": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpool-2", "pool_size": [59, 1], "trainable": true, "strides": [59, 1], "border_mode": "valid"}}, "flatten-2": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-2"}}, "maxpool-4": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpool-4", "pool_size": [57, 1], "trainable": true, "strides": [57, 1], "border_mode": "valid"}}, "flatten-4": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-4"}}, "conv-2": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "b_regularizer": null, "b_constraint": null, "nb_row": 2, "nb_filter": 150, "bias": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "conv-2", "batch_input_shape": [null, 1, 60, 20], "trainable": true, "nb_col": 20, "subsample": [1, 1], "border_mode": "valid"}}, "conv-4": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "b_regularizer": null, "b_constraint": null, "nb_row": 4, "nb_filter": 150, "bias": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "conv-4", "batch_input_shape": [null, 1, 60, 20], "trainable": true, "nb_col": 20, "subsample": [1, 1], "border_mode": "valid"}}}}}, {"class_name": "Dense", "config": {"output_dim": 150, "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_1", "trainable": true, "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_2", "trainable": true, "input_dim": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_2", "trainable": true}}]}