{"loss": "binary_crossentropy", "keras_version": "1.0.4", "optimizer": {"rho": 0.8999999761581421, "lr": 0.0010000000474974513, "name": "RMSprop", "epsilon": 1e-08}, "sample_weight_mode": null, "class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 1, 60, 200], "p": 0.25, "name": "dropout_13"}}, {"class_name": "Graph", "config": {"node_config": [{"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "conv-2", "input": "input", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "maxpool-2", "input": "conv-2", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "flatten-2", "input": "maxpool-2", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "conv-3", "input": "input", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "maxpool-3", "input": "conv-3", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "flatten-3", "input": "maxpool-3", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "conv-4", "input": "input", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "maxpool-4", "input": "conv-4", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "flatten-4", "input": "maxpool-4", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "conv-5", "input": "input", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "maxpool-5", "input": "conv-5", "dot_axes": -1}, {"merge_mode": "concat", "create_output": false, "concat_axis": -1, "inputs": [], "name": "flatten-5", "input": "maxpool-5", "dot_axes": -1}], "output_config": [{"concat_axis": -1, "merge_mode": "concat", "name": "output", "inputs": ["flatten-2", "flatten-3", "flatten-4", "flatten-5"], "input": null, "dot_axes": -1}], "input_config": [{"dtype": "float32", "name": "input", "input_shape": [1, 60, 200]}], "nodes": {"conv-5": {"class_name": "Convolution2D", "config": {"nb_row": 5, "activation": "linear", "input_dtype": "float32", "bias": true, "dim_ordering": "th", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "nb_col": 200, "b_regularizer": null, "nb_filter": 150, "name": "conv-5", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 60, 200], "W_constraint": null}}, "maxpool-3": {"class_name": "MaxPooling2D", "config": {"pool_size": [58, 1], "strides": [58, 1], "border_mode": "valid", "name": "maxpool-3", "dim_ordering": "th", "trainable": true}}, "maxpool-2": {"class_name": "MaxPooling2D", "config": {"pool_size": [59, 1], "strides": [59, 1], "border_mode": "valid", "name": "maxpool-2", "dim_ordering": "th", "trainable": true}}, "flatten-3": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-3"}}, "flatten-2": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-2"}}, "conv-2": {"class_name": "Convolution2D", "config": {"nb_row": 2, "activation": "linear", "input_dtype": "float32", "bias": true, "dim_ordering": "th", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "nb_col": 200, "b_regularizer": null, "nb_filter": 150, "name": "conv-2", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 60, 200], "W_constraint": null}}, "maxpool-4": {"class_name": "MaxPooling2D", "config": {"pool_size": [57, 1], "strides": [57, 1], "border_mode": "valid", "name": "maxpool-4", "dim_ordering": "th", "trainable": true}}, "flatten-5": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-5"}}, "maxpool-5": {"class_name": "MaxPooling2D", "config": {"pool_size": [56, 1], "strides": [56, 1], "border_mode": "valid", "name": "maxpool-5", "dim_ordering": "th", "trainable": true}}, "conv-3": {"class_name": "Convolution2D", "config": {"nb_row": 3, "activation": "linear", "input_dtype": "float32", "bias": true, "dim_ordering": "th", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "nb_col": 200, "b_regularizer": null, "nb_filter": 150, "name": "conv-3", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 60, 200], "W_constraint": null}}, "flatten-4": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-4"}}, "conv-4": {"class_name": "Convolution2D", "config": {"nb_row": 4, "activation": "linear", "input_dtype": "float32", "bias": true, "dim_ordering": "th", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "nb_col": 200, "b_regularizer": null, "nb_filter": 150, "name": "conv-4", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 60, 200], "W_constraint": null}}}}}, {"class_name": "Dense", "config": {"output_dim": 150, "bias": true, "trainable": true, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_13", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_14"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"class_name": "Dense", "config": {"output_dim": 1, "bias": true, "trainable": true, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_14", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_14"}}]}