{"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"batch_input_shape": [null, 1, 60, 20], "name": "dropout_1", "input_dtype": "float32", "trainable": true, "p": 0.25}}, {"class_name": "Graph", "config": {"nodes": {"conv-4": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "nb_filter": 150, "subsample": [1, 1], "nb_row": 4, "name": "conv-4", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "batch_input_shape": [null, 1, 60, 20], "nb_col": 20, "W_regularizer": null, "border_mode": "valid"}}, "conv-2": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "nb_filter": 150, "subsample": [1, 1], "nb_row": 2, "name": "conv-2", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "batch_input_shape": [null, 1, 60, 20], "nb_col": 20, "W_regularizer": null, "border_mode": "valid"}}, "flatten-2": {"class_name": "Flatten", "config": {"name": "flatten-2", "trainable": true}}, "flatten-5": {"class_name": "Flatten", "config": {"name": "flatten-5", "trainable": true}}, "flatten-3": {"class_name": "Flatten", "config": {"name": "flatten-3", "trainable": true}}, "maxpool-4": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [57, 1], "name": "maxpool-4", "border_mode": "valid", "pool_size": [57, 1]}}, "maxpool-6": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [55, 1], "name": "maxpool-6", "border_mode": "valid", "pool_size": [55, 1]}}, "flatten-6": {"class_name": "Flatten", "config": {"name": "flatten-6", "trainable": true}}, "conv-7": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "nb_filter": 150, "subsample": [1, 1], "nb_row": 7, "name": "conv-7", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "batch_input_shape": [null, 1, 60, 20], "nb_col": 20, "W_regularizer": null, "border_mode": "valid"}}, "maxpool-3": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [58, 1], "name": "maxpool-3", "border_mode": "valid", "pool_size": [58, 1]}}, "maxpool-7": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [54, 1], "name": "maxpool-7", "border_mode": "valid", "pool_size": [54, 1]}}, "conv-6": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "nb_filter": 150, "subsample": [1, 1], "nb_row": 6, "name": "conv-6", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "batch_input_shape": [null, 1, 60, 20], "nb_col": 20, "W_regularizer": null, "border_mode": "valid"}}, "conv-3": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "nb_filter": 150, "subsample": [1, 1], "nb_row": 3, "name": "conv-3", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "batch_input_shape": [null, 1, 60, 20], "nb_col": 20, "W_regularizer": null, "border_mode": "valid"}}, "conv-5": {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "nb_filter": 150, "subsample": [1, 1], "nb_row": 5, "name": "conv-5", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "batch_input_shape": [null, 1, 60, 20], "nb_col": 20, "W_regularizer": null, "border_mode": "valid"}}, "maxpool-2": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [59, 1], "name": "maxpool-2", "border_mode": "valid", "pool_size": [59, 1]}}, "flatten-4": {"class_name": "Flatten", "config": {"name": "flatten-4", "trainable": true}}, "maxpool-5": {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [56, 1], "name": "maxpool-5", "border_mode": "valid", "pool_size": [56, 1]}}, "flatten-7": {"class_name": "Flatten", "config": {"name": "flatten-7", "trainable": true}}}, "input_config": [{"input_shape": [1, 60, 20], "name": "input", "dtype": "float32"}], "node_config": [{"dot_axes": -1, "input": "input", "inputs": [], "name": "conv-2", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "conv-2", "inputs": [], "name": "maxpool-2", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "maxpool-2", "inputs": [], "name": "flatten-2", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "input", "inputs": [], "name": "conv-3", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "conv-3", "inputs": [], "name": "maxpool-3", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "maxpool-3", "inputs": [], "name": "flatten-3", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "input", "inputs": [], "name": "conv-4", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "conv-4", "inputs": [], "name": "maxpool-4", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "maxpool-4", "inputs": [], "name": "flatten-4", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "input", "inputs": [], "name": "conv-5", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "conv-5", "inputs": [], "name": "maxpool-5", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "maxpool-5", "inputs": [], "name": "flatten-5", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "input", "inputs": [], "name": "conv-6", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "conv-6", "inputs": [], "name": "maxpool-6", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "maxpool-6", "inputs": [], "name": "flatten-6", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "input", "inputs": [], "name": "conv-7", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "conv-7", "inputs": [], "name": "maxpool-7", "create_output": false, "merge_mode": "concat", "concat_axis": -1}, {"dot_axes": -1, "input": "maxpool-7", "inputs": [], "name": "flatten-7", "create_output": false, "merge_mode": "concat", "concat_axis": -1}], "output_config": [{"dot_axes": -1, "input": null, "inputs": ["flatten-2", "flatten-3", "flatten-4", "flatten-5", "flatten-6", "flatten-7"], "name": "output", "merge_mode": "concat", "concat_axis": -1}]}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "output_dim": 150, "name": "dense_1", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "output_dim": 1, "name": "dense_2", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "sigmoid"}}]}