{"sample_weight_mode": null, "loss": "binary_crossentropy", "class_name": "Sequential", "optimizer": {"lr": 0.0010000000474974513, "epsilon": 1e-08, "rho": 0.8999999761581421, "name": "RMSprop"}, "config": [{"config": {"trainable": true, "batch_input_shape": [null, 1, 60, 200], "input_dtype": "float32", "p": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"input_config": [{"input_shape": [1, 60, 200], "dtype": "float32", "name": "input"}], "output_config": [{"input": null, "dot_axes": -1, "name": "output", "inputs": ["flatten-2", "flatten-3", "flatten-4", "flatten-5", "flatten-6"], "concat_axis": -1, "merge_mode": "concat"}], "nodes": {"flatten-5": {"config": {"trainable": true, "name": "flatten-5"}, "class_name": "Flatten"}, "maxpool-5": {"config": {"pool_size": [56, 1], "dim_ordering": "th", "name": "maxpool-5", "trainable": true, "border_mode": "valid", "strides": [56, 1]}, "class_name": "MaxPooling2D"}, "conv-4": {"config": {"b_regularizer": null, "input_dtype": "float32", "activation": "linear", "name": "conv-4", "trainable": true, "b_constraint": null, "nb_row": 4, "W_constraint": null, "nb_col": 200, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 150, "batch_input_shape": [null, 1, 60, 200], "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, "conv-3": {"config": {"b_regularizer": null, "input_dtype": "float32", "activation": "linear", "name": "conv-3", "trainable": true, "b_constraint": null, "nb_row": 3, "W_constraint": null, "nb_col": 200, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 150, "batch_input_shape": [null, 1, 60, 200], "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, "flatten-2": {"config": {"trainable": true, "name": "flatten-2"}, "class_name": "Flatten"}, "flatten-6": {"config": {"trainable": true, "name": "flatten-6"}, "class_name": "Flatten"}, "maxpool-4": {"config": {"pool_size": [57, 1], "dim_ordering": "th", "name": "maxpool-4", "trainable": true, "border_mode": "valid", "strides": [57, 1]}, "class_name": "MaxPooling2D"}, "conv-5": {"config": {"b_regularizer": null, "input_dtype": "float32", "activation": "linear", "name": "conv-5", "trainable": true, "b_constraint": null, "nb_row": 5, "W_constraint": null, "nb_col": 200, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 150, "batch_input_shape": [null, 1, 60, 200], "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, "flatten-3": {"config": {"trainable": true, "name": "flatten-3"}, "class_name": "Flatten"}, "maxpool-2": {"config": {"pool_size": [59, 1], "dim_ordering": "th", "name": "maxpool-2", "trainable": true, "border_mode": "valid", "strides": [59, 1]}, "class_name": "MaxPooling2D"}, "conv-2": {"config": {"b_regularizer": null, "input_dtype": "float32", "activation": "linear", "name": "conv-2", "trainable": true, "b_constraint": null, "nb_row": 2, "W_constraint": null, "nb_col": 200, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 150, "batch_input_shape": [null, 1, 60, 200], "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, "maxpool-6": {"config": {"pool_size": [55, 1], "dim_ordering": "th", "name": "maxpool-6", "trainable": true, "border_mode": "valid", "strides": [55, 1]}, "class_name": "MaxPooling2D"}, "maxpool-3": {"config": {"pool_size": [58, 1], "dim_ordering": "th", "name": "maxpool-3", "trainable": true, "border_mode": "valid", "strides": [58, 1]}, "class_name": "MaxPooling2D"}, "flatten-4": {"config": {"trainable": true, "name": "flatten-4"}, "class_name": "Flatten"}, "conv-6": {"config": {"b_regularizer": null, "input_dtype": "float32", "activation": "linear", "name": "conv-6", "trainable": true, "b_constraint": null, "nb_row": 6, "W_constraint": null, "nb_col": 200, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 150, "batch_input_shape": [null, 1, 60, 200], "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}}, "node_config": [{"input": "input", "dot_axes": -1, "name": "conv-2", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "conv-2", "dot_axes": -1, "name": "maxpool-2", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "maxpool-2", "dot_axes": -1, "name": "flatten-2", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "input", "dot_axes": -1, "name": "conv-3", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "conv-3", "dot_axes": -1, "name": "maxpool-3", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "maxpool-3", "dot_axes": -1, "name": "flatten-3", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "input", "dot_axes": -1, "name": "conv-4", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "conv-4", "dot_axes": -1, "name": "maxpool-4", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "maxpool-4", "dot_axes": -1, "name": "flatten-4", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "input", "dot_axes": -1, "name": "conv-5", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "conv-5", "dot_axes": -1, "name": "maxpool-5", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "maxpool-5", "dot_axes": -1, "name": "flatten-5", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "input", "dot_axes": -1, "name": "conv-6", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "conv-6", "dot_axes": -1, "name": "maxpool-6", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}, {"input": "maxpool-6", "dot_axes": -1, "name": "flatten-6", "inputs": [], "create_output": false, "concat_axis": -1, "merge_mode": "concat"}]}, "class_name": "Graph"}, {"config": {"activation": "linear", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_1", "W_constraint": null, "output_dim": 150, "input_dim": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activation": "linear", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_2", "W_constraint": null, "output_dim": 1, "input_dim": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}, "class_name": "Activation"}], "keras_version": "1.0.4"}