{"class_name": "Sequential", "keras_version": "1.0.4", "loss": "binary_crossentropy", "optimizer": {"rho": 0.8999999761581421, "lr": 0.0010000000474974513, "name": "RMSprop", "epsilon": 1e-08}, "config": [{"class_name": "Dropout", "config": {"input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 1, 60, 120], "name": "dropout_11", "p": 0.25}}, {"class_name": "Graph", "config": {"output_config": [{"merge_mode": "concat", "input": null, "name": "output", "dot_axes": -1, "concat_axis": -1, "inputs": ["flatten-2", "flatten-3", "flatten-4", "flatten-5", "flatten-6", "flatten-7"]}], "input_config": [{"dtype": "float32", "name": "input", "input_shape": [1, 60, 120]}], "nodes": {"flatten-3": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-3"}}, "conv-6": {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "bias": true, "batch_input_shape": [null, 1, 60, 120], "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "nb_filter": 150, "activation": "linear", "nb_col": 120, "b_regularizer": null, "nb_row": 6, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "name": "conv-6", "dim_ordering": "th"}}, "flatten-4": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-4"}}, "maxpool-5": {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [56, 1], "border_mode": "valid", "pool_size": [56, 1], "name": "maxpool-5", "dim_ordering": "th"}}, "conv-2": {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "bias": true, "batch_input_shape": [null, 1, 60, 120], "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "nb_filter": 150, "activation": "linear", "nb_col": 120, "b_regularizer": null, "nb_row": 2, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "name": "conv-2", "dim_ordering": "th"}}, "conv-5": {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "bias": true, "batch_input_shape": [null, 1, 60, 120], "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "nb_filter": 150, "activation": "linear", "nb_col": 120, "b_regularizer": null, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "name": "conv-5", "dim_ordering": "th"}}, "maxpool-6": {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [55, 1], "border_mode": "valid", "pool_size": [55, 1], "name": "maxpool-6", "dim_ordering": "th"}}, "maxpool-7": {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [54, 1], "border_mode": "valid", "pool_size": [54, 1], "name": "maxpool-7", "dim_ordering": "th"}}, "conv-3": {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "bias": true, "batch_input_shape": [null, 1, 60, 120], "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "nb_filter": 150, "activation": "linear", "nb_col": 120, "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "name": "conv-3", "dim_ordering": "th"}}, "flatten-7": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-7"}}, "flatten-2": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-2"}}, "conv-7": {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "bias": true, "batch_input_shape": [null, 1, 60, 120], "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "nb_filter": 150, "activation": "linear", "nb_col": 120, "b_regularizer": null, "nb_row": 7, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "name": "conv-7", "dim_ordering": "th"}}, "flatten-6": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-6"}}, "conv-4": {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "bias": true, "batch_input_shape": [null, 1, 60, 120], "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "nb_filter": 150, "activation": "linear", "nb_col": 120, "b_regularizer": null, "nb_row": 4, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "name": "conv-4", "dim_ordering": "th"}}, "maxpool-4": {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [57, 1], "border_mode": "valid", "pool_size": [57, 1], "name": "maxpool-4", "dim_ordering": "th"}}, "maxpool-2": {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [59, 1], "border_mode": "valid", "pool_size": [59, 1], "name": "maxpool-2", "dim_ordering": "th"}}, "maxpool-3": {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [58, 1], "border_mode": "valid", "pool_size": [58, 1], "name": "maxpool-3", "dim_ordering": "th"}}, "flatten-5": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-5"}}}, "node_config": [{"merge_mode": "concat", "input": "input", "name": "conv-2", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "conv-2", "name": "maxpool-2", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "maxpool-2", "name": "flatten-2", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "input", "name": "conv-3", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "conv-3", "name": "maxpool-3", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "maxpool-3", "name": "flatten-3", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "input", "name": "conv-4", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "conv-4", "name": "maxpool-4", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "maxpool-4", "name": "flatten-4", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "input", "name": "conv-5", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "conv-5", "name": "maxpool-5", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "maxpool-5", "name": "flatten-5", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "input", "name": "conv-6", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "conv-6", "name": "maxpool-6", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "maxpool-6", "name": "flatten-6", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "input", "name": "conv-7", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "conv-7", "name": "maxpool-7", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}, {"merge_mode": "concat", "input": "maxpool-7", "name": "flatten-7", "create_output": false, "dot_axes": -1, "concat_axis": -1, "inputs": []}]}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 150, "trainable": true, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_11"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_12", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 1, "trainable": true, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_12"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_12"}}], "sample_weight_mode": null}