{"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"batch_input_shape": [null, 1, 60, 50], "p": 0.25, "name": "dropout_1", "trainable": true, "input_dtype": "float32"}}, {"class_name": "Graph", "config": {"input_config": [{"dtype": "float32", "input_shape": [1, 60, 50], "name": "input"}], "node_config": [{"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "input", "inputs": [], "name": "conv-2", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "conv-2", "inputs": [], "name": "maxpool-2", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "maxpool-2", "inputs": [], "name": "flatten-2", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "input", "inputs": [], "name": "conv-3", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "conv-3", "inputs": [], "name": "maxpool-3", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "maxpool-3", "inputs": [], "name": "flatten-3", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "input", "inputs": [], "name": "conv-4", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "conv-4", "inputs": [], "name": "maxpool-4", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "maxpool-4", "inputs": [], "name": "flatten-4", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "input", "inputs": [], "name": "conv-5", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "conv-5", "inputs": [], "name": "maxpool-5", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "maxpool-5", "inputs": [], "name": "flatten-5", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "input", "inputs": [], "name": "conv-6", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "conv-6", "inputs": [], "name": "maxpool-6", "create_output": false}, {"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": "maxpool-6", "inputs": [], "name": "flatten-6", "create_output": false}], "nodes": {"conv-5": {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "input_dtype": "float32", "nb_filter": 150, "W_constraint": null, "batch_input_shape": [null, 1, 60, 50], "name": "conv-5", "nb_row": 5, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 50, "activation": "linear"}}, "maxpool-5": {"class_name": "MaxPooling2D", "config": {"pool_size": [56, 1], "name": "maxpool-5", "border_mode": "valid", "trainable": true, "strides": [56, 1], "dim_ordering": "th"}}, "conv-3": {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "input_dtype": "float32", "nb_filter": 150, "W_constraint": null, "batch_input_shape": [null, 1, 60, 50], "name": "conv-3", "nb_row": 3, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 50, "activation": "linear"}}, "flatten-2": {"class_name": "Flatten", "config": {"name": "flatten-2", "trainable": true}}, "flatten-3": {"class_name": "Flatten", "config": {"name": "flatten-3", "trainable": true}}, "maxpool-2": {"class_name": "MaxPooling2D", "config": {"pool_size": [59, 1], "name": "maxpool-2", "border_mode": "valid", "trainable": true, "strides": [59, 1], "dim_ordering": "th"}}, "flatten-4": {"class_name": "Flatten", "config": {"name": "flatten-4", "trainable": true}}, "maxpool-6": {"class_name": "MaxPooling2D", "config": {"pool_size": [55, 1], "name": "maxpool-6", "border_mode": "valid", "trainable": true, "strides": [55, 1], "dim_ordering": "th"}}, "maxpool-3": {"class_name": "MaxPooling2D", "config": {"pool_size": [58, 1], "name": "maxpool-3", "border_mode": "valid", "trainable": true, "strides": [58, 1], "dim_ordering": "th"}}, "conv-2": {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "input_dtype": "float32", "nb_filter": 150, "W_constraint": null, "batch_input_shape": [null, 1, 60, 50], "name": "conv-2", "nb_row": 2, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 50, "activation": "linear"}}, "flatten-6": {"class_name": "Flatten", "config": {"name": "flatten-6", "trainable": true}}, "conv-6": {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "input_dtype": "float32", "nb_filter": 150, "W_constraint": null, "batch_input_shape": [null, 1, 60, 50], "name": "conv-6", "nb_row": 6, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 50, "activation": "linear"}}, "conv-4": {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "input_dtype": "float32", "nb_filter": 150, "W_constraint": null, "batch_input_shape": [null, 1, 60, 50], "name": "conv-4", "nb_row": 4, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 50, "activation": "linear"}}, "maxpool-4": {"class_name": "MaxPooling2D", "config": {"pool_size": [57, 1], "name": "maxpool-4", "border_mode": "valid", "trainable": true, "strides": [57, 1], "dim_ordering": "th"}}, "flatten-5": {"class_name": "Flatten", "config": {"name": "flatten-5", "trainable": true}}}, "output_config": [{"dot_axes": -1, "merge_mode": "concat", "concat_axis": -1, "input": null, "inputs": ["flatten-2", "flatten-3", "flatten-4", "flatten-5", "flatten-6"], "name": "output"}]}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "input_dim": null, "activation": "linear", "name": "dense_1", "b_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 150}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "input_dim": null, "activation": "linear", "name": "dense_2", "b_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_2", "trainable": true}}]}