{"config": [{"config": {"batch_input_shape": [null, 1, 60, 20], "input_dtype": "float32", "trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"input_config": [{"input_shape": [1, 60, 20], "name": "input", "dtype": "float32"}], "node_config": [{"concat_axis": -1, "name": "conv-2", "merge_mode": "concat", "dot_axes": -1, "input": "input", "inputs": [], "create_output": false}, {"concat_axis": -1, "name": "maxpool-2", "merge_mode": "concat", "dot_axes": -1, "input": "conv-2", "inputs": [], "create_output": false}, {"concat_axis": -1, "name": "flatten-2", "merge_mode": "concat", "dot_axes": -1, "input": "maxpool-2", "inputs": [], "create_output": false}, {"concat_axis": -1, "name": "conv-3", "merge_mode": "concat", "dot_axes": -1, "input": "input", "inputs": [], "create_output": false}, {"concat_axis": -1, "name": "maxpool-3", "merge_mode": "concat", "dot_axes": -1, "input": "conv-3", "inputs": [], "create_output": false}, {"concat_axis": -1, "name": "flatten-3", "merge_mode": "concat", "dot_axes": -1, "input": "maxpool-3", "inputs": [], "create_output": false}, {"concat_axis": -1, "name": "conv-4", "merge_mode": "concat", "dot_axes": -1, "input": "input", "inputs": [], "create_output": false}, {"concat_axis": -1, "name": "maxpool-4", "merge_mode": "concat", "dot_axes": -1, "input": "conv-4", "inputs": [], "create_output": false}, {"concat_axis": -1, "name": "flatten-4", "merge_mode": "concat", "dot_axes": -1, "input": "maxpool-4", "inputs": [], "create_output": false}], "nodes": {"flatten-3": {"config": {"trainable": true, "name": "flatten-3"}, "class_name": "Flatten"}, "conv-3": {"config": {"activity_regularizer": null, "input_dtype": "float32", "init": "glorot_uniform", "W_constraint": null, "nb_col": 20, "name": "conv-3", "dim_ordering": "th", "nb_filter": 150, "b_constraint": null, "batch_input_shape": [null, 1, 60, 20], "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, "maxpool-4": {"config": {"border_mode": "valid", "strides": [57, 1], "pool_size": [57, 1], "name": "maxpool-4", "trainable": true, "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, "flatten-4": {"config": {"trainable": true, "name": "flatten-4"}, "class_name": "Flatten"}, "conv-2": {"config": {"activity_regularizer": null, "input_dtype": "float32", "init": "glorot_uniform", "W_constraint": null, "nb_col": 20, "name": "conv-2", "dim_ordering": "th", "nb_filter": 150, "b_constraint": null, "batch_input_shape": [null, 1, 60, 20], "b_regularizer": null, "nb_row": 2, "border_mode": "valid", "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, "maxpool-3": {"config": {"border_mode": "valid", "strides": [58, 1], "pool_size": [58, 1], "name": "maxpool-3", "trainable": true, "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, "flatten-2": {"config": {"trainable": true, "name": "flatten-2"}, "class_name": "Flatten"}, "conv-4": {"config": {"activity_regularizer": null, "input_dtype": "float32", "init": "glorot_uniform", "W_constraint": null, "nb_col": 20, "name": "conv-4", "dim_ordering": "th", "nb_filter": 150, "b_constraint": null, "batch_input_shape": [null, 1, 60, 20], "b_regularizer": null, "nb_row": 4, "border_mode": "valid", "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, "maxpool-2": {"config": {"border_mode": "valid", "strides": [59, 1], "pool_size": [59, 1], "name": "maxpool-2", "trainable": true, "dim_ordering": "th"}, "class_name": "MaxPooling2D"}}, "output_config": [{"concat_axis": -1, "name": "output", "merge_mode": "concat", "dot_axes": -1, "input": null, "inputs": ["flatten-2", "flatten-3", "flatten-4"]}]}, "class_name": "Graph"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "name": "dense_1", "b_regularizer": null, "input_dim": null, "output_dim": 150, "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "name": "dense_2", "b_regularizer": null, "input_dim": null, "output_dim": 1, "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}