{"sample_weight_mode": null, "optimizer": {"name": "RMSprop", "lr": 0.0010000000474974513, "epsilon": 1e-08, "rho": 0.8999999761581421}, "keras_version": "1.0.4", "class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"input_dtype": "float32", "name": "dropout_3", "batch_input_shape": [null, 1, 60, 50], "p": 0.25, "trainable": true}}, {"class_name": "Graph", "config": {"output_config": [{"name": "output", "inputs": ["flatten-2", "flatten-3", "flatten-4", "flatten-5", "flatten-6"], "input": null, "dot_axes": -1, "concat_axis": -1, "merge_mode": "concat"}], "node_config": [{"name": "conv-2", "inputs": [], "input": "input", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "maxpool-2", "inputs": [], "input": "conv-2", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "flatten-2", "inputs": [], "input": "maxpool-2", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "conv-3", "inputs": [], "input": "input", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "maxpool-3", "inputs": [], "input": "conv-3", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "flatten-3", "inputs": [], "input": "maxpool-3", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "conv-4", "inputs": [], "input": "input", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "maxpool-4", "inputs": [], "input": "conv-4", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "flatten-4", "inputs": [], "input": "maxpool-4", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "conv-5", "inputs": [], "input": "input", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "maxpool-5", "inputs": [], "input": "conv-5", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "flatten-5", "inputs": [], "input": "maxpool-5", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "conv-6", "inputs": [], "input": "input", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "maxpool-6", "inputs": [], "input": "conv-6", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}, {"name": "flatten-6", "inputs": [], "input": "maxpool-6", "dot_axes": -1, "concat_axis": -1, "create_output": false, "merge_mode": "concat"}], "nodes": {"conv-2": {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "nb_col": 50, "nb_filter": 150, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "input_dtype": "float32", "name": "conv-2", "batch_input_shape": [null, 1, 60, 50], "nb_row": 2, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "trainable": true}}, "maxpool-4": {"class_name": "MaxPooling2D", "config": {"name": "maxpool-4", "pool_size": [57, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "strides": [57, 1]}}, "flatten-4": {"class_name": "Flatten", "config": {"name": "flatten-4", "trainable": true}}, "conv-3": {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "nb_col": 50, "nb_filter": 150, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "input_dtype": "float32", "name": "conv-3", "batch_input_shape": [null, 1, 60, 50], "nb_row": 3, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "trainable": true}}, "maxpool-5": {"class_name": "MaxPooling2D", "config": {"name": "maxpool-5", "pool_size": [56, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "strides": [56, 1]}}, "maxpool-3": {"class_name": "MaxPooling2D", "config": {"name": "maxpool-3", "pool_size": [58, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "strides": [58, 1]}}, "flatten-5": {"class_name": "Flatten", "config": {"name": "flatten-5", "trainable": true}}, "conv-5": {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "nb_col": 50, "nb_filter": 150, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "input_dtype": "float32", "name": "conv-5", "batch_input_shape": [null, 1, 60, 50], "nb_row": 5, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "trainable": true}}, "flatten-2": {"class_name": "Flatten", "config": {"name": "flatten-2", "trainable": true}}, "flatten-6": {"class_name": "Flatten", "config": {"name": "flatten-6", "trainable": true}}, "maxpool-6": {"class_name": "MaxPooling2D", "config": {"name": "maxpool-6", "pool_size": [55, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "strides": [55, 1]}}, "flatten-3": {"class_name": "Flatten", "config": {"name": "flatten-3", "trainable": true}}, "maxpool-2": {"class_name": "MaxPooling2D", "config": {"name": "maxpool-2", "pool_size": [59, 1], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "strides": [59, 1]}}, "conv-4": {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "nb_col": 50, "nb_filter": 150, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "input_dtype": "float32", "name": "conv-4", "batch_input_shape": [null, 1, 60, 50], "nb_row": 4, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "trainable": true}}, "conv-6": {"class_name": "Convolution2D", "config": {"activation": "linear", "subsample": [1, 1], "nb_col": 50, "nb_filter": 150, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "input_dtype": "float32", "name": "conv-6", "batch_input_shape": [null, 1, 60, 50], "nb_row": 6, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "trainable": true}}}, "input_config": [{"name": "input", "input_shape": [1, 60, 50], "dtype": "float32"}]}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "output_dim": 150, "b_regularizer": null, "name": "dense_3", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "name": "dense_4", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "sigmoid", "trainable": true}}], "loss": "binary_crossentropy"}