{"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "input_dtype": "float32", "name": "dropout_1", "batch_input_shape": [null, 1, 60, 20]}}, {"class_name": "Graph", "config": {"nodes": {"maxpool-2": {"class_name": "MaxPooling2D", "config": {"pool_size": [59, 1], "border_mode": "valid", "trainable": true, "strides": [59, 1], "dim_ordering": "th", "name": "maxpool-2"}}, "conv-3": {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "bias": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 20, "W_regularizer": null, "batch_input_shape": [null, 1, 60, 20], "W_constraint": null, "nb_row": 3, "activation": "linear", "nb_filter": 150, "input_dtype": "float32", "name": "conv-3", "b_regularizer": null, "init": "glorot_uniform"}}, "flatten-2": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-2"}}, "flatten-3": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-3"}}, "conv-4": {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "bias": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 20, "W_regularizer": null, "batch_input_shape": [null, 1, 60, 20], "W_constraint": null, "nb_row": 4, "activation": "linear", "nb_filter": 150, "input_dtype": "float32", "name": "conv-4", "b_regularizer": null, "init": "glorot_uniform"}}, "flatten-4": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten-4"}}, "maxpool-4": {"class_name": "MaxPooling2D", "config": {"pool_size": [57, 1], "border_mode": "valid", "trainable": true, "strides": [57, 1], "dim_ordering": "th", "name": "maxpool-4"}}, "conv-2": {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "bias": true, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 20, "W_regularizer": null, "batch_input_shape": [null, 1, 60, 20], "W_constraint": null, "nb_row": 2, "activation": "linear", "nb_filter": 150, "input_dtype": "float32", "name": "conv-2", "b_regularizer": null, "init": "glorot_uniform"}}, "maxpool-3": {"class_name": "MaxPooling2D", "config": {"pool_size": [58, 1], "border_mode": "valid", "trainable": true, "strides": [58, 1], "dim_ordering": "th", "name": "maxpool-3"}}}, "input_config": [{"dtype": "float32", "name": "input", "input_shape": [1, 60, 20]}], "node_config": [{"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "input", "name": "conv-2"}, {"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "conv-2", "name": "maxpool-2"}, {"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "maxpool-2", "name": "flatten-2"}, {"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "input", "name": "conv-3"}, {"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "conv-3", "name": "maxpool-3"}, {"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "maxpool-3", "name": "flatten-3"}, {"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "input", "name": "conv-4"}, {"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "conv-4", "name": "maxpool-4"}, {"dot_axes": -1, "concat_axis": -1, "inputs": [], "create_output": false, "merge_mode": "concat", "input": "maxpool-4", "name": "flatten-4"}], "output_config": [{"dot_axes": -1, "concat_axis": -1, "inputs": ["flatten-2", "flatten-3", "flatten-4"], "merge_mode": "concat", "input": null, "name": "output"}]}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "output_dim": 150, "input_dim": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "output_dim": 1, "input_dim": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}}]}