{"sample_weight_mode": null, "config": [{"config": {"batch_input_shape": [null, 60, 190], "p": 0.25, "input_dtype": "float32", "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"input_dim": 190, "U_regularizer": null, "dropout_W": 0.2, "stateful": false, "unroll": false, "output_dim": 150, "forget_bias_init": "one", "init": "glorot_uniform", "input_length": null, "return_sequences": false, "inner_activation": "hard_sigmoid", "activation": "tanh", "inner_init": "orthogonal", "dropout_U": 0.2, "consume_less": "cpu", "W_regularizer": null, "go_backwards": false, "b_regularizer": null, "name": "lstm_5", "trainable": true}, "class_name": "LSTM"}, {"config": {"input_dim": null, "name": "dense_5", "output_dim": 1, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_5", "trainable": true}, "class_name": "Activation"}], "optimizer": {"rho": 0.8999999761581421, "lr": 0.0010000000474974513, "name": "RMSprop", "epsilon": 1e-08}, "keras_version": "1.0.4", "class_name": "Sequential", "loss": "binary_crossentropy"}