{"sample_weight_mode": null, "optimizer": {"name": "RMSprop", "lr": 0.0010000000474974513, "rho": 0.8999999761581421, "epsilon": 1e-08}, "keras_version": "1.0.4", "loss": "binary_crossentropy", "class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "input_dtype": "float32", "name": "dropout_4", "batch_input_shape": [null, 60, 160]}}, {"class_name": "LSTM", "config": {"input_length": null, "inner_activation": "hard_sigmoid", "input_dim": 160, "dropout_W": 0.2, "consume_less": "cpu", "unroll": false, "U_regularizer": null, "name": "lstm_4", "return_sequences": false, "W_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "dropout_U": 0.2, "stateful": false, "b_regularizer": null, "trainable": true, "inner_init": "orthogonal", "activation": "tanh", "go_backwards": false, "forget_bias_init": "one"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 1, "name": "dense_4", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "sigmoid"}}]}