{"loss": "binary_crossentropy", "config": [{"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 60, 200], "p": 0.25}}, {"class_name": "LSTM", "config": {"activation": "tanh", "U_regularizer": null, "unroll": false, "go_backwards": false, "input_length": null, "dropout_W": 0.2, "consume_less": "cpu", "W_regularizer": null, "forget_bias_init": "one", "trainable": true, "dropout_U": 0.2, "init": "glorot_uniform", "stateful": false, "input_dim": 200, "inner_activation": "hard_sigmoid", "name": "lstm_2", "return_sequences": false, "inner_init": "orthogonal", "b_regularizer": null, "output_dim": 100}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "W_regularizer": null, "name": "dense_2", "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "sigmoid", "trainable": true}}], "optimizer": {"name": "RMSprop", "rho": 0.8999999761581421, "lr": 0.0010000000474974513, "epsilon": 1e-08}, "class_name": "Sequential", "sample_weight_mode": null, "keras_version": "1.0.4"}