{"config": [{"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_19", "batch_input_shape": [null, 60, 240], "input_dtype": "float32", "p": 0.25}}, {"class_name": "LSTM", "config": {"dropout_U": 0.2, "stateful": false, "b_regularizer": null, "return_sequences": false, "name": "lstm_19", "input_length": null, "inner_init": "orthogonal", "go_backwards": false, "trainable": true, "input_dim": 240, "dropout_W": 0.2, "unroll": false, "init": "glorot_uniform", "forget_bias_init": "one", "consume_less": "cpu", "inner_activation": "hard_sigmoid", "U_regularizer": null, "W_regularizer": null, "output_dim": 150, "activation": "tanh"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "name": "dense_19", "b_constraint": null, "trainable": true, "input_dim": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "sigmoid"}}], "keras_version": "1.0.4", "loss": "binary_crossentropy", "sample_weight_mode": null, "class_name": "Sequential", "optimizer": {"name": "RMSprop", "epsilon": 1e-08, "rho": 0.8999999761581421, "lr": 0.0010000000474974513}}