{"loss": "binary_crossentropy", "sample_weight_mode": null, "config": [{"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_19", "input_dtype": "float32", "batch_input_shape": [null, 60, 200]}}, {"class_name": "LSTM", "config": {"go_backwards": false, "forget_bias_init": "one", "inner_init": "orthogonal", "dropout_U": 0.2, "b_regularizer": null, "stateful": false, "output_dim": 50, "trainable": true, "name": "lstm_19", "dropout_W": 0.2, "input_dim": 200, "unroll": false, "consume_less": "cpu", "return_sequences": false, "activation": "tanh", "init": "glorot_uniform", "input_length": null, "inner_activation": "hard_sigmoid", "U_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "b_regularizer": null, "activation": "linear", "output_dim": 1, "name": "dense_19", "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_19"}}], "keras_version": "1.0.4", "class_name": "Sequential", "optimizer": {"epsilon": 1e-08, "rho": 0.8999999761581421, "name": "RMSprop", "lr": 0.0010000000474974513}}