{"loss": "binary_crossentropy", "sample_weight_mode": null, "class_name": "Sequential", "keras_version": "1.0.4", "optimizer": {"epsilon": 1e-08, "name": "RMSprop", "lr": 0.0010000000474974513, "rho": 0.8999999761581421}, "config": [{"class_name": "Dropout", "config": {"input_dtype": "float32", "p": 0.25, "name": "dropout_2", "batch_input_shape": [null, 60, 160], "trainable": true}}, {"class_name": "LSTM", "config": {"output_dim": 100, "U_regularizer": null, "return_sequences": false, "inner_init": "orthogonal", "forget_bias_init": "one", "trainable": true, "dropout_U": 0.2, "dropout_W": 0.2, "unroll": false, "activation": "tanh", "inner_activation": "hard_sigmoid", "stateful": false, "b_regularizer": null, "go_backwards": false, "name": "lstm_2", "W_regularizer": null, "consume_less": "cpu", "input_length": null, "input_dim": 160, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 1, "bias": true, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_2", "b_constraint": null, "input_dim": null, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "sigmoid", "trainable": true}}]}