{"sample_weight_mode": null, "keras_version": "1.0.4", "optimizer": {"rho": 0.8999999761581421, "name": "RMSprop", "epsilon": 1e-08, "lr": 0.0010000000474974513}, "class_name": "Sequential", "config": [{"config": {"p": 0.25, "trainable": true, "name": "dropout_5", "input_dtype": "float32", "batch_input_shape": [null, 60, 160]}, "class_name": "Dropout"}, {"config": {"return_sequences": false, "input_dim": 160, "forget_bias_init": "one", "go_backwards": false, "activation": "tanh", "trainable": true, "input_length": null, "consume_less": "cpu", "dropout_U": 0.2, "name": "lstm_5", "output_dim": 50, "b_regularizer": null, "inner_init": "orthogonal", "U_regularizer": null, "stateful": false, "dropout_W": 0.2, "unroll": false, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "W_regularizer": null}, "class_name": "LSTM"}, {"config": {"input_dim": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "bias": true, "output_dim": 1, "b_regularizer": null, "name": "dense_5", "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "sigmoid"}, "class_name": "Activation"}], "loss": "binary_crossentropy"}